app/Helpers/ciuis_helper.php

function load_config()
{
	// Obter a instância do banco de dados
	$db = Database::connect();

	// Obter as configurações da tabela 'branding'
	$builder = $db->table('branding');
	$configs = $builder->get()->getResultArray();
---
SELECT *
FROM `branding`

function get_appconfig()
{
	$ci = Config\Database::connect();
	$configs = $ci->table('appconfig')->get()->getResultArray();
---
SELECT *
FROM `appconfig`

function get_dateFormat()
{
	$ci = \Config\Database::connect();
	$dateFormat = $ci->table('settings')->get()->getRow()->dateformat;
---
SELECT *
FROM `settings`

function get_dateTimeFormat()
{

	$ci = \Config\Database::connect();
	$dateFormat = $ci->table('settings')->get()->getRow()->dateformat;
---
SELECT *
FROM `settings`