app/Controllers/Api.php

SELECT *
FROM `settings_ia`
WHERE `staff_id` = '6'
---
	function settings()
	{

		$settings = $this->Settings_Model->get_settings_ciuis();
		$settings['smtppassoword'] = '********';
		$settings['timers'] = $this->Settings_Model->if_timer();
		$newnotification = $this->Notifications_Model->get_notification();
		$settings['newnotification'] = $newnotification ? true : false;
		$settings['notifications'] = $newnotification;

		$settings['settings_ia'] = $this->db->table('settings_ia')->where('staff_id', session()->usr_id)->get()->getRowArray();

SELECT *
FROM `chatreplies`
WHERE (`chat_staff1` = 6 and `chat_staff2` = 1) or (`chat_staff2` = 6 and `chat_staff1` = 1)
ORDER BY `date` DESC
 LIMIT 1
---
	function chats()
	{
		$chats = [];
		$chats = $this->Chats_Model->get_all_chats_by_privileges();
		$data_chats = [];
		if ($chats) {

			foreach ($chats as $chat) {

				$builder = $this->db->table('chatreplies');
				$builder->select('*');
				$builder->where('(chat_staff1 = ' . session()->get('usr_id') . ' and chat_staff2 = ' . $chat['id'] . ') or (chat_staff2 = ' . session()->get('usr_id') . ' and chat_staff1 = ' . $chat['id'] . ')');
				$builder->orderBy('date', 'desc');
				$builder->limit(1);
				$query = $builder->get();

SELECT *
FROM `staff`
WHERE `staff`.`id_company` = '1'
AND `id` = '1'
---
	function getDetails($id)
	{
		$builder = $this->db->table('staff');
		$builder->where('staff.id_company', session()->get('id_company'));
		$builder->where('id', $id);
		$query = $builder->get();

SELECT *
FROM `table_columns`
WHERE `relation` = 'leads'
---
	function table_columns($relation)
	{

		$builder = $this->db->table('table_columns');
		$builder->where('relation', $relation);
		$columns = $builder->get()->getResultArray();