app/Controllers/Chats.php

SELECT *
FROM `chatreplies`
WHERE (`chat_staff1` = 6 and `chat_staff2` = 1) or (`chat_staff2` = 6 and `chat_staff1` = 1)
ORDER BY `id` DESC
 LIMIT 1
---
	function chats()
	{
		$chats = $this->Chats_Model->get_all_chats_by_privileges();
		$data_chats = [];

		foreach ($chats as $chat) {
			$ultimaMsg = $this->db->table('chatreplies')
				->select('*')
				->where('(chat_staff1 = ' . session()->get('usr_id') . ' and chat_staff2 = ' . $chat['id'] . ') or (chat_staff2 = ' . session()->get('usr_id') . ' and chat_staff1 = ' . $chat['id'] . ')')
				->orderBy('id', 'desc')
				->limit(1)
				->get()
				->getRowArray();

SELECT *
FROM `staff`
WHERE `id` = '1'
AND `id_company` = '1'
---
	function getDetails($id)
	{
		return $this->db->table('staff')->where('id', $id)->where('id_company', session()->id_company)->get()->getRowArray();