app/Controllers/Leads.php

SELECT COUNT(*) AS `numrows` FROM `notifications`
SELECT COUNT(*) AS `numrows` FROM `leads`
---
	function index()
	{
		$data['title'] = lang2('leads');
		$data['tbs'] = $this->db->table('notifications')->where('markread', '0')->countAll();

		if ($this->Privileges_Model->check_privilege('leads', 'all')) {
			$data['tlh'] = $this->db->table('leads')->countAll();