app/Models/Fields_Model.php

	function custom_fields_by_type($type)
	{
		$builder = $this->db->table('custom_fields');
		$builder->select('*');
		$builder->where('relation', $type);
		$builder->orderBy('order', 'asc');
		return $builder->get()->getResultArray();
---
SELECT *
FROM `custom_fields`
WHERE `relation` = 'lead'
ORDER BY `order` ASC