app/Models/Leads_Model.php

SELECT *
FROM `leads_list`
WHERE `id_company` = '1'
ORDER BY `nm_list` ASC
---
	function get_all_leads_list($super = 0)
	{
		$builder = $this->db->table('leads_list');
		$builder->select('*');
		if ($super == 0) {
			$builder->where('id_company', session()->id_company);
		}
		$builder->orderBy('nm_list', 'asc');
		return $builder->get()
			->getResultArray();

SELECT *, `leadsstatus`.`name` as `statusname`, `staff`.`staffname` as `leadassigned`, `staff`.`staffavatar` as `assignedavatar`, `leadssources`.`name` as `sourcename`, `leads`.`name` as `leadname`, `leads`.`email` as `leadmail`, `leads`.`phone` as `leadphone`, `leads`.`id` as `id`
FROM `leads`
LEFT JOIN `leadsstatus` ON `leads`.`status` = `leadsstatus`.`id`
LEFT JOIN `leadssources` ON `leads`.`source` = `leadssources`.`id`
LEFT JOIN `staff` ON `leads`.`assigned_id` = `staff`.`id`
ORDER BY `leads`.`id` DESC
 LIMIT 100
---
	function get_all_leads_for_admin()
	{
		$builder = $this->db->table('leads');
		$builder->select('*,leadsstatus.name as statusname,staff.staffname as leadassigned,staff.staffavatar as assignedavatar,leadssources.name as sourcename,leads.name as leadname,leads.email as leadmail,leads.phone as leadphone,leads.id as id');
		$builder->join('leadsstatus', 'leads.status = leadsstatus.id', 'left');
		$builder->join('leadssources', 'leads.source = leadssources.id', 'left');
		$builder->join('staff', 'leads.assigned_id = staff.id', 'left');
		$builder->orderBy('leads.id', 'desc');
		$builder->limit(100);
		return $builder->get()->getResultArray();

SELECT *
FROM `leadssources`
WHERE `leadssources`.`id_company` = '1'
---
	function get_leads_sources($global = false)
	{
		$builder = $this->db->table('leadssources');
		if (!$global) {
			$builder->where('leadssources.id_company', session()->get('id_company'));
		}
		return $builder->get()->getResultArray();

SELECT *
FROM `leadsstatus`
WHERE `id_list` = '65'
ORDER BY `ordem` ASC
---
	function get_leads_sources_by_list2($id)
	{
		$builder = $this->db->table('leadsstatus');
		$builder->select('*');
		$builder->where('id_list', $id);
		$builder->orderBy('ordem', 'asc');
		return $builder->get()->getResultArray();