app/Models/Notifications_Model.php

	public function newnotification()
	{
		$builder = $this->db->table('notifications');
		$builder->join('staff', 'notifications.staff_id = staff.id', 'left');
		$builder->where('staff.id_company', session()->get('id_company'));
		$new = $builder->where(['markread' => 0, 'staff_id' => session()->get('usr_id')])->get()->getResult();
---
SELECT *
FROM `notifications`
LEFT JOIN `staff` ON `notifications`.`staff_id` = `staff`.`id`
WHERE `staff`.`id_company` = '1'
AND `markread` = 0
AND `staff_id` = '6'

	public function get_notification()
	{
		$builder = $this->db->table('notifications');
		$builder->select('*, notifications.id as id_notifications');
		$builder->join('staff', 'notifications.staff_id_acao = staff.id', 'left');
		$builder->join('avisos', 'avisos.id_aviso = notifications.id_aviso', 'left');
		$builder->where('staff.id_company', session()->get('id_company'));
		$builder->orderBy('notifications.id', 'desc');
		$builder->limit(20);
		$new = $builder->where('notifications.staff_id', session()->get('usr_id'))->get()->getResult();
---
SELECT *, `notifications`.`id` as `id_notifications`
FROM `notifications`
LEFT JOIN `staff` ON `notifications`.`staff_id_acao` = `staff`.`id`
LEFT JOIN `avisos` ON `avisos`.`id_aviso` = `notifications`.`id_aviso`
WHERE `staff`.`id_company` = '1'
AND `notifications`.`staff_id` = '6'
ORDER BY `notifications`.`id` DESC
 LIMIT 20