app/Models/Privileges_Model.php

	public function has_privilege($path)
	{



		$staff_id = session()->usr_id;
		$role = $this->db->table('staff')->where('id', $staff_id)->get()->getRowArray();
		$role_id = $role['role_id'];


		$permission = $this->db->table('permissions')->where('key', $path)->get()->getRowArray();
		$permission_id = isset($permission['id']) ? $permission['id'] : 0;
		$permissions = $this->db->table('role_permissions')->where(['permission_id' => $permission_id, 'role_id' => $role_id])->get()->getRowArray();



		$permissionsCompany = $this->get_all_permissionsByCompany(session()->id_company);


		$permissionsCompanyData = [];
		foreach ($permissionsCompany as $row) {
			$permissionsCompanyData[] = $row['id_permission'];
		}

		$company = $this->db->table('companies')->where('id_company', session()->id_company)->get()->getRowArray();
---
SELECT *
FROM `staff`
WHERE `id` = '6'
SELECT *
FROM `permissions`
WHERE `key` = 'leads'
SELECT *
FROM `role_permissions`
WHERE `permission_id` = '6'
AND `role_id` = '1'
SELECT *
FROM `companies`
WHERE `id_company` = '1'

	public function check_privilege($path, $type)
	{
		$staff_id = session()->usr_id;
		$role = $this->db->table('staff')->where('id', $staff_id)->get()->getRowArray();
		$role_id = $role['role_id'];
		$permission = $this->db->table('permissions')->where('key', $path)->get()->getRowArray();
		$permission_id = $permission['id'];
		$permission = $this->db->table('role_permissions')->where(['permission_id' => $permission_id, 'role_id' => $role_id])->get()->getRowArray();
---
SELECT *
FROM `staff`
WHERE `id` = '6'
SELECT *
FROM `permissions`
WHERE `key` = 'leads'
SELECT *
FROM `role_permissions`
WHERE `permission_id` = '6'
AND `role_id` = '1'

	public function get_all_permissionsByCompany($company)
	{
		return $this->db->table('companies_permission')
			->join('permissions', 'permissions.id = companies_permission.id_permission', 'left')
			->where('id_company', $company)
			->get()
			->getResultArray();
---
SELECT *
FROM `companies_permission`
LEFT JOIN `permissions` ON `permissions`.`id` = `companies_permission`.`id_permission`
WHERE `id_company` = '1'