app/Models/Report_Model.php

	function tcl($staff_id = '')
	{
		$builder = $this->db->table('leads');

		$builder->select('COUNT(*) AS count')
			->join('staff', 'leads.staff_id = staff.id', 'left')
			->where('staff.id_company', session()->id_company)
			->where('dateconverted IS NOT NULL ');
		if ($staff_id) {
			$builder->groupStart()
				->where('staff_id', $staff_id)
				->orWhere('assigned_id', $staff_id)
				->groupEnd();
		}
		$tcl = $builder->get()->getRow()->count;
---
SELECT COUNT(*) AS count
FROM `leads`
LEFT JOIN `staff` ON `leads`.`staff_id` = `staff`.`id`
WHERE `staff`.`id_company` = '1'
AND `dateconverted` IS NOT NULL

	function tll($staff_id = '')
	{
		$builder = $this->db->table('leads')
			->select('COUNT(*) AS count')
			->join('staff', 'leads.staff_id = staff.id', 'left')
			->where('staff.id_company', session()->id_company)
			->where('lost', 1);
		if ($staff_id) {
			$builder->groupStart()
				->where('staff_id', $staff_id)
				->orWhere('assigned_id', $staff_id)
				->groupEnd();
		}
		$tll = $builder->get()->getRow()->count;
---
SELECT COUNT(*) AS count
FROM `leads`
LEFT JOIN `staff` ON `leads`.`staff_id` = `staff`.`id`
WHERE `staff`.`id_company` = '1'
AND `lost` = 1

	function tjl($staff_id = '')
	{
		$builder = $this->db->table('leads')
			->select('COUNT(*) AS count')
			->join('staff', 'leads.staff_id = staff.id', 'left')
			->where('staff.id_company', session()->id_company)
			->where('junk', 1);
		if ($staff_id) {
			$builder->groupStart()
				->where('staff_id', $staff_id)
				->orWhere('assigned_id', $staff_id)
				->groupEnd();
		}
		$tjl = $builder->get()->getRow()->count;
---
SELECT COUNT(*) AS count
FROM `leads`
LEFT JOIN `staff` ON `leads`.`staff_id` = `staff`.`id`
WHERE `staff`.`id_company` = '1'
AND `junk` = 1