app/Models/Settings_Model.php

	public function get_settings_ciuis($id_company = null, $staff_id = null)
	{

		$session = session();

		if ($id_company == null && $session->get('id_company') != null) {
			$id_company = $session->get('id_company');
		} else if ($id_company == null && $session->get('id_company') == null) {
			$id_company = 1;
		}

		if ($staff_id == null && $session->get('usr_id') != null) {
			$staff_id = $session->get('usr_id');
		} else if ($staff_id == null && $session->get('usr_id') == null) {
			$staff_id = 35;
		}

		$builder = $this->db->table('settings');
		$builder->select('*, languages.name as language, settings.settingname as settingname');
		$builder->join('languages', 'settings.languageid = languages.foldername', 'left');
		$result = $builder->where('id_company', $id_company)->get()->getRowArray();


		$settings_email = $this->db->table('settings_email')->where('staff_id', $staff_id)->get()->getRowArray();
---
SELECT *, `languages`.`name` as `language`, `settings`.`settingname` as `settingname`
FROM `settings`
LEFT JOIN `languages` ON `settings`.`languageid` = `languages`.`foldername`
WHERE `id_company` = '1'
SELECT *
FROM `settings_email`
WHERE `staff_id` = '6'

	public function get_settings_ciuis_origin($idCompany = null, $staff_id = null)
	{
		$session = session();

		if ($idCompany == null) {
			$idCompany = $session->get('id_company');
		}

		if ($staff_id == null) {
			$staff_id = $session->get('usr_id');
		}

		$result = $this->db->table('settings')->where('id_company', $idCompany)->get()->getRowArray();
		$settings_email = $this->db->table('settings_email')->where('staff_id', $staff_id)->get()->getRowArray();

		$result['motivos_pausa'] = $this->db->table('settings_motivos_pausa')->where('id_company', $idCompany)->get()->getResultArray();
---
SELECT *
FROM `settings`
WHERE `id_company` = '1'
SELECT *
FROM `settings_email`
WHERE `staff_id` = '6'
SELECT *
FROM `settings_motivos_pausa`
WHERE `id_company` = '1'

	function get_version_detail()
	{
		return $this->db->table('versions')->orderBy('id', 'desc')->get()->getRowArray();
---
SELECT *
FROM `versions`
ORDER BY `id` DESC

	function get_menus()
	{

		return $this->db->table('menu')
			->where(['main_menu' => '0', 'is_ativo' => '1'])
			->orderBy('order_id', 'ASC')
			->get()
			->getResultArray();
---
SELECT *
FROM `menu`
WHERE `main_menu` = '0'
AND `is_ativo` = '1'
ORDER BY `order_id` ASC

	function get_submenus($id)
	{
		return $this->db->table('menu')
			->orderBy('order_id', 'ASC')
			->where('main_menu', $id)
			->where('is_ativo', '1')
			->get()
			->getResultArray();
---
SELECT *
FROM `menu`
WHERE `main_menu` = '1'
AND `is_ativo` = '1'
ORDER BY `order_id` ASC

	public function if_timer()
	{
		$builder = $this->db->table('tasktimer');
		$builder->where('end', NULL);
		$builder->where('staff_id', session()->get('usr_id'));
		$data = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tasktimer`
WHERE `end` IS NULL
AND `staff_id` = '6'