app/Models/Staff_Model.php

    function get_staff($id)
    {
        $builder = \Config\Database::connect()->table('staff');
        $builder->select('*, languages.name as stafflanguage, departments.name as department, staff.id as id, staff.role_id as role_id');
        $builder->join('departments', 'staff.department_id = departments.id', 'left');
        $builder->join('languages', 'staff.language = languages.foldername', 'left');
        $builder->join('roles', 'staff.role_id = roles.role_id', 'left');
        $builder->where('staff.id_company', session()->get('id_company'));

        return $builder->where('staff.id', $id)->get()->getRowArray();
---
SELECT *, `languages`.`name` as `stafflanguage`, `departments`.`name` as `department`, `staff`.`id` as `id`, `staff`.`role_id` as `role_id`
FROM `staff`
LEFT JOIN `departments` ON `staff`.`department_id` = `departments`.`id`
LEFT JOIN `languages` ON `staff`.`language` = `languages`.`foldername`
LEFT JOIN `roles` ON `staff`.`role_id` = `roles`.`role_id`
WHERE `staff`.`id_company` = '1'
AND `staff`.`id` = '6'

    function get_all_staff($global = false, $inactives = false)
    {
        $builder = \Config\Database::connect()->table('staff');
        $builder->select('*, departments.name as department, staff.id as id, staff.id_company as id_company_staff');
        $builder->join('departments', 'staff.department_id = departments.id', 'left');

        if (!$global) {
            $builder->where('staff.id_company', session()->get('id_company'));
        } elseif (session()->get('super_admin') !== "1") {
            $builder->where('staff.id_company', session()->get('id_company'));
        }
        if (!$inactives) {
            $builder->where('staff.inactive IS NULL');
        }

        return $builder->get()->getResultArray();
---
SELECT *, `departments`.`name` as `department`, `staff`.`id` as `id`, `staff`.`id_company` as `id_company_staff`
FROM `staff`
LEFT JOIN `departments` ON `staff`.`department_id` = `departments`.`id`
WHERE `staff`.`id_company` = '1'
AND `staff`.`inactive` IS NULL